Revit 2025 API
VirtualPrinterType Enumeration
An enumerated to list Virtual Printer Types in Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum VirtualPrinterType
Public Enumeration VirtualPrinterType
public enum class VirtualPrinterType
type VirtualPrinterType
Members
Member name | Value | Description
None | 0 |  None.
AdobePDF | 1 |  AdobePDF.
DWFWriter | 2 |  DWFWriter.
XPSWriter | 3 |  Microsoft XPS Document Writer.
See Also
Reference
Autodesk.Revit.DB Namespace